In [1]:
#How to deal with the missing values of data?
#1. Keep it
#2 Remove it
#3 Replace it
import numpy as np
import pandas as pd
np.nan

#Lets firsst see the keep values command
#But first its important to review about how NaN values work

nan

In [3]:
pd.NA
pd.NaT

NaT

In [4]:
np.nan = np.nan
#(this will be false)
#is different from
np.nan is np.nan
#(this will be true)

True

In [6]:
mv_scores = pd.read_csv('movie_scores.csv')

In [9]:
mv_scores

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [12]:
mv_scores.notnull
mv_scores.isnull

<bound method DataFrame.isnull of   first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0>

In [13]:
#we can select columns where we have not null values or where we have null values
mv_scores[mv_scores['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [20]:
mv_scores[(mv_scores['pre_movie_score'].notnull()) & (mv_scores['first_name']=='Emma')]
mv_scores

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [21]:
mv_scores
#dropna with some criteria:
#thresh means that if a row has more than N non-NaN values, keep it
#Example:
mv_scores.dropna(thresh=1)
#All keep because all of them have at least one non-nan value.If I put thresh=5, Hugh Jackman will probably be erased
mv_scores.dropna(thresh=5)
#voil√°!

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [22]:
#Now lets talk about the axis argument
mv_scores
#If we use axis=1 only, it will erase all columns that have NaN values.
mv_scores.dropna(axis=1)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0